0xsmirk/mcu_cmsis_svd/Spansion/MB9AF13xK.svd
        <!-- REGISTER "ELVR" -->
        <register>
          <name>ELVR</name>
          <description>External Interrupt Level Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC00030FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LB15" -->
            <field>
              <name>LB15</name>
              <description>Bit31 of ELVR</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA15" -->
            <field>
              <name>LA15</name>
              <description>Bit30 of ELVR</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB6" -->
            <field>
              <name>LB6</name>
              <description>Bit13 of ELVR</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA6" -->
            <field>
              <name>LA6</name>
              <description>Bit12 of ELVR</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB3" -->
            <field>
              <name>LB3</name>
              <description>Bit7 of ELVR</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA3" -->
            <field>
              <name>LA3</name>
              <description>Bit6 of ELVR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB2" -->
            <field>
              <name>LB2</name>
              <description>Bit5 of ELVR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA2" -->
            <field>
              <name>LA2</name>
              <description>Bit4 of ELVR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB1" -->
            <field>
              <name>LB1</name>
              <description>Bit3 of ELVR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA1" -->
            <field>
              <name>LA1</name>
              <description>Bit2 of ELVR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB0" -->
            <field>
              <name>LB0</name>
              <description>Bit1 of ELVR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA0" -->
            <field>
              <name>LA0</name>
              <description>Bit0 of ELVR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NMIRR" -->
        <register>
          <name>NMIRR</name>
          <description>Non Maskable Interrupt Request Register</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NR" -->
            <field>
              <name>NR</name>
              <description>NMI interrupt request detection bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NMICL" -->
        <register>
          <name>NMICL</name>
          <description>Non Maskable Interrupt Clear Register</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NCL" -->
            <field>
              <name>NCL</name>
              <description>NMI interrupt cause clear bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "INTREQ" -->
    <peripheral>
      <name>INTREQ</name>
      <description>Interrupts</description>
      <groupName>INTREQ</groupName>
      <baseAddress>0x40031000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x10</offset>
        <size>0x84</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "EXC02MON" -->
        <register>
          <name>EXC02MON</name>
          <description>EXC02 batch read register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HWINT" -->
            <field>
              <name>HWINT</name>
              <description>Hardware watchdog timer interrupt request</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NMI" -->
            <field>
              <name>NMI</name>
              <description>External NMIX pin interrupt request </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ00MON" -->
        <register>
          <name>IRQ00MON</name>
          <description>IRQ00 Batch Read Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSINT" -->
            <field>
              <name>FCSINT</name>
              <description>Anomalous frequency detection by CSV interrupt request </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ01MON" -->
        <register>
          <name>IRQ01MON</name>
          <description>IRQ01 Batch Read Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWWDTINT" -->
            <field>
              <name>SWWDTINT</name>
              <description>Software watchdog timer interrupt request </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ02MON" -->
        <register>
          <name>IRQ02MON</name>
          <description>IRQ02 Batch Read Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDINT" -->
            <field>
              <name>LVDINT</name>
              <description>Low voltage detection (LVD) interrupt request </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
